Revit 2026 API

# TransformBasisX Property

---

The basis of the X axis of this transformation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ BasisX { get; set; }
```
```vb
Public Property BasisX As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ BasisX {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member BasisX : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the transform is internally marked as read-only. |

The X axis of the old coordinate system in the new coordinate system, or the 1st column of the conventional 3x4 matrix representation.

#### Reference

Transform Class

Autodesk.Revit.DB Namespace